{
  "archmage": "Mirela Gabriela Dragesku",
  "chapters": [
    "Prologue",
    "Childhood"
  ],
  "Prologue": [
    [
      "Transylvania almost never played a noticeable role in European history.",
      "Maybe because this country never had enough strong mages, or valuable resources or its kings were stupid.",
      "But there was one mage of awful skill and power seemingly beyond the limits of any mortal creature.",
      "Her name is Mirela Gabriela Dragesku. You can find a street in Sorgros named after her and a monument of the Mages Square."
    ], [
      "So, imagine yourself a country where endless civil war ongoing, neither side actually wants to win.",
      "Citizens are tired from this seemingly endless madness.",
      "Many poor people die from starvation.",
      "Few rich people become even richer than ever before.",
      "Some unlucky rich people loose everything and get their heads on the pikes, but another take their place.",
      "Brave and noble people rise against this bloody mess, but soon they die or start making money out of war themselves."
    ], [
      "Baron Vlad Dragesku was smart enough and lucky enough to survive almost ten years of civil war, save his money and health.",
      "Around the age of thirty he realized that he is not powerful enough to win this war and chances to survive another five or ten years were quite low.",
      "So Baron Vlad Dragesku married a sole daughter of another old and rich Baron.",
      "About a year after a marriage the old and rich Baron dies from pox and all his fortune goes to Baron Vlad Dragesku.",
      "Another year after his death daughter of the old and rich Baron gives birth to a boy named Valerian.",
      "Next year she gives birth to a girl named Mirela and dies soon after this."
    ], [
      "There were bizarre rumors that Baron Vlad Dragesku had killed his wife and her father as soon as he took everything he wanted from them.",
      "For those who like such stories: there is no evidence Baron Vlad Dragesku or his minions done this, so let us call it a lucky (or unlucky) coincidence.",
      "More probably, Baron Vlad Dragesku loved his wife, because after her death he was dark and grim.",
      "You can't say he was very cheerful before, but from this dreadful event and till the end of his life Baron Vlad Dragesku was sad and sorrow."
    ], [
      "So these are circumstances of Mirela's birthday.",
      "It was 4411 November 7, cold, dark, gray and windy day.",
      "Some can say a happy person can't be born on such day, but the Universe does not forbid people born on a day with bad weather to be happy.",
      "Doctors had said Mirela probably will be a mage.",
      "Probably, a strong mage."
    ], [
      "But everybody knows, when dealing with magic you can never be certain."
    ]
  ],
  "Childhood": [
    [
      "And Baron Vlad Dragesku hoped and waited, it was a long, almost seven years long waiting.",
      "Long before the moment Mirela made her first magic trick it became clear as day she was a soul really loved to fight.",
      "Small cute girl fought almost everybody.",
      "Guards, servants, severe father and beloved brother: everybody Mirela could reach with her fists got at least couple of her punches.",
      "Soon Baron Vlad Dragesku gave up on making Mirela a perfect charming lady and trained her to fight along with Valerian."
    ], [
      "Valerian was much more peaceful than his sister and even his fighting style was different.",
      "While Mirela was rushing her opponents with lots of hits, Valerian was mostly relying on opponent's mistakes and he was good in exploiting it.",
      "When Mirela's magic powers broke through, her fighting abilities high-rocketed and Valerian was a bit jealous."
    ], [
      "Everybody wants a magic powers too, at least at the age of 7-30 years.",
      "Typically, magic powers show up around the age of ten and from this age and on chances of becoming a mage decreasing with every single year.",
      "Around the age of thirty they are practically zero and last living hopes are broken and people live on their non-magical lives."
    ], [
      "Valerian's magic hadn't appeared at the age of ten and he gave up on his hope to become a mage quite early.",
      "He studied well, he trained well and he was one of the most well-educated and well-trained people of Transylvania.",
      "Time would show that it was enough to become a wise king and build up a decent country from ruins."
    ], [
      "Mirela's training started almost immediately after it had come to known she will be a water master.",
      "Father hired two tutors.",
      "One was the water master and other was the earth master who became Mirela's fighting mentor.",
      "Mirela was very talented and hard-working student.",
      "Her skills were growing rapidly.",
      "At age of nine she was fighting as good as an average twenty-thirteen-year-old apprentice.",
      "Fighting mentor also insisted Mirela need to learn how to fight with earth and air masters.",
      "He also insisted she need to learn how to fight a fire master, but unfortunately, there were no such master in Transylvania and even Baron Vlad Dragesku with all his wealth could not afford such luxury for his daughter."
    ], [
      "When Mirela became fourteen she was successfully beating any adult water, earth or air master.",
      "Fighting mentor insisted Mirela should join some clan to have real fights for further progress.",
      "Father and brother argued she was just a fourteen-year old girl.",
      "Young girls are not supposed to fight on real adult wars in real adult battles where people likely get killed or get severe wounds.",
      "Fighting mentor argued that she is not an ordinary young girl but quite mature and strong water master and the battle mage.",
      "Her whole life will be one battle after another and sooner she will get through the first one it will better for her."
    ], [
      "Baron Vlad Dragesku took a long time to think.",
      "He did not wanted to loose his precious daughter when he spent so much resources and time to make her a big master.",
      "Fighting mentor said that keeping battle mage out of battles is almost the same as killing her with his own hands.",
      "Besides she is brave enough to go against father's will and results of it can be much worse.",
      "Mirela wants to fight and she will fight anyway. Let it be father's will so he can take some precautionary measures.",
      "It will better to give her freedom to choose her own clan.",
      "Finally, Baron Vlad Dragesku agreed."
    ], [
      "Mirela's attention was caught by the Maelstrom clan.",
      "Their numbers were not very impressive, but they were known as skillful water masters and ruthless mercenaries.",
      "Some proclaimed their leader Stanimir Tsvetkov was one of the best water masters in Transylvania, and probably was in Europe's top ten.",
      "Despite that he had a reputation of the unfaithful mercenary.",
      "Stanimir Tsvetkov and his clan fought for those who payed him more money.",
      "That's why he was richer than some Barons and was not the one who wished to end the Civil War."
    ], [
      "Baron Vlad Dragesku took another week to weight his decision.",
      "The war was brutal, thousands of people died in battles or got severe wounds.",
      "It was great risk on becoming disabled after the first battle.",
      "You should be very brave to let your children to such place, even under a heavy guard.",
      "He often looked in her clear and beautiful face with some thin smile on it and couldn't imagine how she will behave in the heart of battle.",
      "Mirela told father she is not “princess” kind of woman.",
      "Her training was good, her clan was good, her skills were above the average and she will be well-guarded.",
      "And what the actual difference between going to war now and a year or two later?",
      "She'll not get any better by training anymore.",
      "Father pointed out that Maelstrom clan had a bad reputation.",
      "Fighting Mentor pointed out that most of the top-level clans of Transylvania had a bad reputation."
    ], [
      "With heavy weight on his heart, father agreed."
    ]
  ]
}
